<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GraphPad Prism.</string>
	<key>Identifier</key>
	<string>com.github.kryptonit1.download.Prism</string>
	<key>Input</key>
	<dict>
	  	<key>NAME</key>
	  	<string>Prism</string>
	  	<key>DOWNLOAD_BASE_URL</key>
	  	<string>http://cdn.graphpad.com/downloads/prism</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Locate the latest major version of Prism</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.graphpad.com/support/</string>
				<key>re_pattern</key>
				<string>([\d]+).[\d]+[a-z] \(Mac\)</string>
				<key>result_output_var_name</key>
				<string>LATEST_MAJOR_VERSION</string>
			</dict>
		</dict>
	    <dict>
			<key>Comment</key>
			<string>Locate the latest update of Prism</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.graphpad.com/support/</string>
				<key>re_pattern</key>
				<string>[\d]+.[\d]+([a-z]) \(Mac\)</string>
				<key>result_output_var_name</key>
				<string>LATEST_UPDATE</string>
			</dict>
	    </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>InstallPrism%LATEST_MAJOR_VERSION%%LATEST_UPDATE%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_BASE_URL%/%LATEST_MAJOR_VERSION%/InstallPrism%LATEST_MAJOR_VERSION%%LATEST_UPDATE%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/%NAME% %LATEST_MAJOR_VERSION%.app/Contents/version.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
	    </dict>
	    <dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Prism %LATEST_MAJOR_VERSION%.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.GraphPad.Prism" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "YQ2D36NS9M")</string>
			</dict>
	    </dict>
	</array>
</dict>
</plist>
