<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Zotero and creates a package</string>
    <key>Identifier</key>
    <string>com.github.kryptonit1.pkg.zotero</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Zotero</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.joshua-d-miller.download.zotero</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
              	<key>dmg_path</key>
              	<string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
          </dict>
          <dict>
              <key>Arguments</key>
              <dict>
                  <key>pkgdirs</key>
                  <dict>
                      <key>Applications</key>
                      <string>0775</string>
                  </dict>
                  <key>pkgroot</key>
                  <string>%RECIPE_CACHE_DIR%/%NAME%</string>
              </dict>
              <key>Processor</key>
              <string>PkgRootCreator</string>
          </dict>
          <dict>
              <key>Arguments</key>
              <dict>
                  <key>destination_path</key>
                  <string>%pkgroot%/Applications/%NAME%.app</string>
                  <key>source_path</key>
                  <string>%pathname%/%NAME%.app</string>
              </dict>
              <key>Processor</key>
              <string>Copier</string>
          </dict>
          <dict>
            <key>Arguments</key>
            <dict>
              <key>pkg_request</key>
              <dict>
                  <key>chown</key>
                  <array>
                      <dict>
                          <key>group</key>
                          <string>admin</string>
                          <key>path</key>
                          <string>Applications</string>
                          <key>user</key>
                          <string>root</string>
                      </dict>
                  </array>
                  <key>id</key>
                  <string>%bundleid%</string>
                  <key>options</key>
                  <string>purge_ds_store</string>
                  <key>pkgname</key>
                  <string>%NAME%-%version%</string>
                  <key>pkgroot</key>
                  <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                  <key>version</key>
                  <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
